{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"[UNK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"[CLS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"[SEP]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":4,"special":true,"content":"[MASK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":5,"special":true,"content":"[BPE]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":6,"special":true,"content":"\r","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":7,"special":true,"content":"\t","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":8,"special":true,"content":"\u000b","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":9,"special":true,"content":"\n\n","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":10,"special":true,"content":"\n","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":11,"special":true,"content":"        ","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":12,"special":true,"content":"    ","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":13,"special":true,"content":"  ","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":14,"special":true,"content":" ","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30000,"special":true,"content":"[forward_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30001,"special":true,"content":"[ms_unsigned_ptr_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30002,"special":true,"content":"[record_struct_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30003,"special":true,"content":"[ms_call_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30004,"special":true,"content":"[begin_block]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30005,"special":true,"content":"[make_ref_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30006,"special":true,"content":"[receiver_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30007,"special":true,"content":"[join_into_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30008,"special":true,"content":"[list_binding_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30009,"special":true,"content":"[primary_constructor_base_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30010,"special":true,"content":"[ref_value_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30011,"special":true,"content":"[nullsafe_member_call_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30012,"special":true,"content":"[match_operator]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30013,"special":true,"content":"[function_pointer_unmanaged_calling_convention_list]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30014,"special":true,"content":"[function_pointer_unmanaged_calling_convention]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30015,"special":true,"content":"[const_block]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30016,"special":true,"content":"[enum_declaration_list]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30017,"special":true,"content":"[enum_case]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30018,"special":true,"content":"[end_block]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30019,"special":true,"content":"[type_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30020,"special":true,"content":"[decl_tyfam_sig]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30021,"special":true,"content":"[use_instead_of_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30022,"special":true,"content":"[exp_unboxed_sum]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30023,"special":true,"content":"[constrain_module_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30024,"special":true,"content":"[type_unboxed_sum]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30025,"special":true,"content":"[rational]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30026,"special":true,"content":"[let_open_class_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30027,"special":true,"content":"[requires_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30028,"special":true,"content":"[typed_class_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30029,"special":true,"content":"[warning_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30030,"special":true,"content":"[exp_sum_empty]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30031,"special":true,"content":"[let_open_class_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30032,"special":true,"content":"[quoted_item_extension]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30033,"special":true,"content":"[complex]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30034,"special":true,"content":"[group_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30035,"special":true,"content":"[omitting_type_annotation]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30036,"special":true,"content":"[extern_alias_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30037,"special":true,"content":"[attributed_declarator]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30038,"special":true,"content":"[query_continuation]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30039,"special":true,"content":"[quoted_extension]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30040,"special":true,"content":"[undef_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30041,"special":true,"content":"[positional_pattern_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30042,"special":true,"content":"[parenthesized_class_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30043,"special":true,"content":"[primitive_definition]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30044,"special":true,"content":"[match_default_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30045,"special":true,"content":"[expent]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30046,"special":true,"content":"[view_bound]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30047,"special":true,"content":"[with_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30048,"special":true,"content":"[with_initializer_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30049,"special":true,"content":"[namespace_export]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30050,"special":true,"content":"[function_pointer_calling_convention]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30051,"special":true,"content":"[co_return_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30052,"special":true,"content":"[named_label_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30053,"special":true,"content":"[redo]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30054,"special":true,"content":"[file_scoped_namespace_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30055,"special":true,"content":"[asserts]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30056,"special":true,"content":"[template_literal_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30057,"special":true,"content":"[interpolation_alignment_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30058,"special":true,"content":"[format_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30059,"special":true,"content":"[meta_property]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30060,"special":true,"content":"[match_conditional_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30061,"special":true,"content":"[match_condition_list]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30062,"special":true,"content":"[function_pointer_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30063,"special":true,"content":"[do_module]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30064,"special":true,"content":"[simple_assignment_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30065,"special":true,"content":"[class_function]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30066,"special":true,"content":"[var_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30067,"special":true,"content":"[destructured_left_assignment]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30068,"special":true,"content":"[default_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30069,"special":true,"content":"[exec_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30070,"special":true,"content":"[binary_integer_literal]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30071,"special":true,"content":"[module_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30072,"special":true,"content":"[module_body]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30073,"special":true,"content":"[rest_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30074,"special":true,"content":"[namespace_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30075,"special":true,"content":"[relational_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30076,"special":true,"content":"[exponentiation_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30077,"special":true,"content":"[let_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30078,"special":true,"content":"[namespace_use_group]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30079,"special":true,"content":"[transform]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30080,"special":true,"content":"[order_by_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30081,"special":true,"content":"[shebang]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30082,"special":true,"content":"[attributed_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30083,"special":true,"content":"[uninterpreted]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30084,"special":true,"content":"[jsx_namespace_name]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30085,"special":true,"content":"[co_await_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30086,"special":true,"content":"[foreign_export]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30087,"special":true,"content":"[rest_assignment]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30088,"special":true,"content":"[debugger_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30089,"special":true,"content":"[undef]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30090,"special":true,"content":"[named_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30091,"special":true,"content":"[functional_extension]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30092,"special":true,"content":"[rec]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30093,"special":true,"content":"[qualified_type_operator]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30094,"special":true,"content":"[do_while_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30095,"special":true,"content":"[join_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30096,"special":true,"content":"[role_annotation]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30097,"special":true,"content":"[record_binding_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30098,"special":true,"content":"[expression_colon]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30099,"special":true,"content":"[define_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30100,"special":true,"content":"[refutation_case]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30101,"special":true,"content":"[until_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30102,"special":true,"content":"[pat_negation]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30103,"special":true,"content":"[error_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30104,"special":true,"content":"[unsafe_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30105,"special":true,"content":"[negative_literal]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30106,"special":true,"content":"[let_exception_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30107,"special":true,"content":"[type_unboxed_tuple]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30108,"special":true,"content":"[subpattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30109,"special":true,"content":"[function_pointer_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30110,"special":true,"content":"[constructor_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30111,"special":true,"content":"[retry]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30112,"special":true,"content":"[type_role]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30113,"special":true,"content":"[shell_command_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30114,"special":true,"content":"[binary_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30115,"special":true,"content":"[opting_type_annotation]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30116,"special":true,"content":"[ref_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30117,"special":true,"content":"[annotated_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30118,"special":true,"content":"[switch_rule]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30119,"special":true,"content":"[until]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30120,"special":true,"content":"[when_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30121,"special":true,"content":"[property_promotion_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30122,"special":true,"content":"[parenthesized_module_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30123,"special":true,"content":"[for_lifetimes]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30124,"special":true,"content":"[ms_pointer_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30125,"special":true,"content":"[ms_restrict_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30126,"special":true,"content":"[stack_alloc_array_creation_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30127,"special":true,"content":"[catch_filter_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30128,"special":true,"content":"[nonlocal_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30129,"special":true,"content":"[while_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30130,"special":true,"content":"[data_constructor_infix]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30131,"special":true,"content":"[destructor_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30132,"special":true,"content":"[ms_declspec_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30133,"special":true,"content":"[hash_bang_line]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30134,"special":true,"content":"[functor]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30135,"special":true,"content":"[property_pattern_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30136,"special":true,"content":"[namespace_use_group_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30137,"special":true,"content":"[lazy_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30138,"special":true,"content":"[imaginary_literal]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30139,"special":true,"content":"[tycon_arrow]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30140,"special":true,"content":"[exp_if_guard]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30141,"special":true,"content":"[inst_datainst]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30142,"special":true,"content":"[union_item]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30143,"special":true,"content":"[elif_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30144,"special":true,"content":"[recursive_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30145,"special":true,"content":"[via]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30146,"special":true,"content":"[data_family]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30147,"special":true,"content":"[jsx_fragment]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30148,"special":true,"content":"[module_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30149,"special":true,"content":"[instantiated_class_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30150,"special":true,"content":"[ref_qualifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30151,"special":true,"content":"[class_initializer]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30152,"special":true,"content":"[implicit_param]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30153,"special":true,"content":"[empty_file]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30154,"special":true,"content":"[ticked]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30155,"special":true,"content":"[supports_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30156,"special":true,"content":"[structured_binding_declarator]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30157,"special":true,"content":"[constructor_constraint]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30158,"special":true,"content":"[instance_variable_specification]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30159,"special":true,"content":"[generic_type_with_turbofish]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30160,"special":true,"content":"[default_signature]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30161,"special":true,"content":"[preproc_string_literal]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30162,"special":true,"content":"[checked_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30163,"special":true,"content":"[type_conversion]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30164,"special":true,"content":"[signed_number]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30165,"special":true,"content":"[preproc_integer_literal]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30166,"special":true,"content":"[decl_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30167,"special":true,"content":"[override_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30168,"special":true,"content":"[event_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30169,"special":true,"content":"[contravariant_type_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30170,"special":true,"content":"[data_instance]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30171,"special":true,"content":"[lower_bound]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30172,"special":true,"content":"[attribute_target_specifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30173,"special":true,"content":"[for]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30174,"special":true,"content":"[in]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30175,"special":true,"content":"[interpolation_format_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30176,"special":true,"content":"[abstract_class_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30177,"special":true,"content":"[chevron]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30178,"special":true,"content":"[variadic_unpacking]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30179,"special":true,"content":"[generator_function]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30180,"special":true,"content":"[fundeps]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30181,"special":true,"content":"[set_comprehension]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30182,"special":true,"content":"[typed_module_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30183,"special":true,"content":"[generator_function_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30184,"special":true,"content":"[trait_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30185,"special":true,"content":"[fixed_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30186,"special":true,"content":"[indexing_operator_path]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30187,"special":true,"content":"[negated_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30188,"special":true,"content":"[parenthesized_query]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30189,"special":true,"content":"[higher_ranked_trait_bound]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30190,"special":true,"content":"[instantiated_class]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30191,"special":true,"content":"[discard]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30192,"special":true,"content":"[module_type_of]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30193,"special":true,"content":"[import_alias]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30194,"special":true,"content":"[class_function_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30195,"special":true,"content":"[charset_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30196,"special":true,"content":"[annotation_type_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30197,"special":true,"content":"[annotation_type_body]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30198,"special":true,"content":"[implicit_parid]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30199,"special":true,"content":"[format_specifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30200,"special":true,"content":"[fallthrough_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30201,"special":true,"content":"[rescue_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30202,"special":true,"content":"[anonymous_method_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30203,"special":true,"content":"[quote_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30204,"special":true,"content":"[fundep]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30205,"special":true,"content":"[annotation_type_element_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30206,"special":true,"content":"[indexer_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30207,"special":true,"content":"[bracketed_parameter_list]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30208,"special":true,"content":"[attribute_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30209,"special":true,"content":"[operator_cast]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30210,"special":true,"content":"[captured_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30211,"special":true,"content":"[empty_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30212,"special":true,"content":"[indexing_operator]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30213,"special":true,"content":"[infer_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30214,"special":true,"content":"[object_copy_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30215,"special":true,"content":"[toplevel_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30216,"special":true,"content":"[directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30217,"special":true,"content":"[mapped_type_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30218,"special":true,"content":"[hash_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30219,"special":true,"content":"[nullable_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30220,"special":true,"content":"[import_package]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30221,"special":true,"content":"[functor_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30222,"special":true,"content":"[conversion_operator_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30223,"special":true,"content":"[throw_specifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30224,"special":true,"content":"[destructured_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30225,"special":true,"content":"[dynamic_variable_name]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30226,"special":true,"content":"[query_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30227,"special":true,"content":"[select_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30228,"special":true,"content":"[size_of_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30229,"special":true,"content":"[readonly_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30230,"special":true,"content":"[symbol_literal]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30231,"special":true,"content":"[is_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30232,"special":true,"content":"[abstract_method_signature]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30233,"special":true,"content":"[template_template_parameter_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30234,"special":true,"content":"[package_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30235,"special":true,"content":"[construct_signature]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30236,"special":true,"content":"[blank_identifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30237,"special":true,"content":"[from_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30238,"special":true,"content":"[local_function_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30239,"special":true,"content":"[loop_label]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30240,"special":true,"content":"[instance_variable_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30241,"special":true,"content":"[dot]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30242,"special":true,"content":"[qualified_constructor_operator]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30243,"special":true,"content":"[projected_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30244,"special":true,"content":"[and_operator]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30245,"special":true,"content":"[pat_irrefutable]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30246,"special":true,"content":"[exp_unboxed_tuple]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30247,"special":true,"content":"[case_pattern_switch_label]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30248,"special":true,"content":"[local_open_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30249,"special":true,"content":"[clone_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30250,"special":true,"content":"[subshell]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30251,"special":true,"content":"[const_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30252,"special":true,"content":"[package_object]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30253,"special":true,"content":"[pat_unboxed_tuple]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30254,"special":true,"content":"[slice_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30255,"special":true,"content":"[variadic_declarator]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30256,"special":true,"content":"[aliased_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30257,"special":true,"content":"[enum_body_declarations]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30258,"special":true,"content":"[include_once_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30259,"special":true,"content":"[covariant_type_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30260,"special":true,"content":"[polymorphic_variant_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30261,"special":true,"content":"[function_static_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30262,"special":true,"content":"[line_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30263,"special":true,"content":"[bigarray_get_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30264,"special":true,"content":"[conditional_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30265,"special":true,"content":"[static_variable_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30266,"special":true,"content":"[right_assignment_list]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30267,"special":true,"content":"[private_property_identifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30268,"special":true,"content":"[optional_type_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30269,"special":true,"content":"[namespace_definition_name]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30270,"special":true,"content":"[constrain_module]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30271,"special":true,"content":"[class_application]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30272,"special":true,"content":"[abstract_parenthesized_declarator]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30273,"special":true,"content":"[delegate_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30274,"special":true,"content":"[packed_module]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30275,"special":true,"content":"[variadic_type_parameter_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30276,"special":true,"content":"[class_type_definition]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30277,"special":true,"content":"[inheritance_specification]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30278,"special":true,"content":"[decltype]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30279,"special":true,"content":"[chained_string]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30280,"special":true,"content":"[alias]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30281,"special":true,"content":"[fixity]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30282,"special":true,"content":"[package_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30283,"special":true,"content":"[operator_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30284,"special":true,"content":"[implicit_length_array_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30285,"special":true,"content":"[import_require_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30286,"special":true,"content":"[singleton_class]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30287,"special":true,"content":"[heredoc]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30288,"special":true,"content":"[setter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30289,"special":true,"content":"[constrained_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30290,"special":true,"content":"[label]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30291,"special":true,"content":"[delete_method_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30292,"special":true,"content":"[symbol_array]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30293,"special":true,"content":"[parameter_pack_expansion]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30294,"special":true,"content":"[ensure]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30295,"special":true,"content":"[static_initializer]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30296,"special":true,"content":"[floating_attribute]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30297,"special":true,"content":"[element_binding_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30298,"special":true,"content":"[while]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30299,"special":true,"content":"[type_star]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30300,"special":true,"content":"[variadic_parameter]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30301,"special":true,"content":"[event_field_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30302,"special":true,"content":"[break]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30303,"special":true,"content":"[template_instantiation]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30304,"special":true,"content":"[val_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30305,"special":true,"content":"[type_family]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30306,"special":true,"content":"[extends_interfaces]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30307,"special":true,"content":"[head]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30308,"special":true,"content":"[namespace]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30309,"special":true,"content":"[class_type_binding]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30310,"special":true,"content":"[final_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30311,"special":true,"content":"[new_declarator]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30312,"special":true,"content":"[command_string]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30313,"special":true,"content":"[con_tuple]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30314,"special":true,"content":"[include_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30315,"special":true,"content":"[line_number_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30316,"special":true,"content":"[class_literal]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30317,"special":true,"content":"[capture_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30318,"special":true,"content":"[by_ref]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30319,"special":true,"content":"[type_predicate_annotation]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30320,"special":true,"content":"[let_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30321,"special":true,"content":"[class_body_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30322,"special":true,"content":"[switch_expression_arm]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30323,"special":true,"content":"[abstract_definition]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30324,"special":true,"content":"[type_bound]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30325,"special":true,"content":"[hex_floating_point_literal]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30326,"special":true,"content":"[else_directive]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30327,"special":true,"content":"[implicit_object_creation_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30328,"special":true,"content":"[inferred_parameters]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30329,"special":true,"content":"[abstract_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30330,"special":true,"content":"[reference_assignment_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30331,"special":true,"content":"[lock_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30332,"special":true,"content":"[index_type_query]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30333,"special":true,"content":"[type_predicate]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30334,"special":true,"content":"[class_variable]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30335,"special":true,"content":"[object_assignment_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30336,"special":true,"content":"[struct_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30337,"special":true,"content":"[type_instance]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30338,"special":true,"content":"[tuple_element]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30339,"special":true,"content":"[safety]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30340,"special":true,"content":"[nesting_selector]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30341,"special":true,"content":"[var_modifier]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30342,"special":true,"content":"[checked_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30343,"special":true,"content":"[field_definition]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30344,"special":true,"content":"[do]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30345,"special":true,"content":"[anonymous_function_use_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30346,"special":true,"content":"[from]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30347,"special":true,"content":"[lazy_parameter_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30348,"special":true,"content":"[associated_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30349,"special":true,"content":"[while_let_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30350,"special":true,"content":"[require_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30351,"special":true,"content":"[default_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30352,"special":true,"content":"[pat_view]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30353,"special":true,"content":"[dictionary_comprehension]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30354,"special":true,"content":"[let_class_expression]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30355,"special":true,"content":"[alternative_pattern]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30356,"special":true,"content":"[removed_trait_bound]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30357,"special":true,"content":"[synchronized_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30358,"special":true,"content":"[dependent_name]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30359,"special":true,"content":"[hash_splat_argument]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30360,"special":true,"content":"[trailing_return_type]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30361,"special":true,"content":"[async_block]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30362,"special":true,"content":"[foreign_mod_item]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30363,"special":true,"content":"[inheritance_definition]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30364,"special":true,"content":"[namespace_aliasing_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30365,"special":true,"content":"[try_with_resources_statement]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30366,"special":true,"content":"[resource_specification]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30367,"special":true,"content":"[default_method_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30368,"special":true,"content":"[friend_declaration]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30369,"special":true,"content":"[call_signature]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30370,"special":true,"content":"[list_literal]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30371,"special":true,"content":"[extends_type_clause]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30372,"special":true,"content":"[user_defined_literal]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":30373,